{"id":338,"date":"2019-01-29T22:24:28","date_gmt":"2019-01-30T03:24:28","guid":{"rendered":"http:\/\/ccvcl.org\/?p=338"},"modified":"2023-08-05T14:21:51","modified_gmt":"2023-08-05T18:21:51","slug":"previous-activities","status":"publish","type":"post","link":"http:\/\/ccvcl.org\/previous-activities\/","title":{"rendered":"Previous Activities"},"content":{"rendered":"\n<p><strong>November 09, 2021.<\/strong> Lab Member Steven Alsheimer, a master student in the Data Science Program at the Graduate Center, will be a Data Scientist with Canon, starting by the end of November. Congratulations!<\/p>\n\n\n\n<p><strong>November 1, 2021.<\/strong> Lab Members  Arber Ruci and Jin Chen  are leading a startup <a href=\"https:\/\/nearabl.com\/\">Nearabl<\/a>, a spin-off from the <a href=\"http:\/\/ccvcl.org\/smart-and-accessible-transportation-hub\/\">NSF PFI Project SAT-Hub<\/a>. Read more in <a href=\"https:\/\/finance.yahoo.com\/news\/nearabl-app-created-blind-moving-204000360.html\">a news item in Yahoo Finance<\/a>.  <\/p>\n\n\n\n<p><strong>September 14, 2021<\/strong>, CCNY Places 3rd In International Overhead Imagery Hackathon [<a href=\"https:\/\/www1.cuny.edu\/mu\/forum\/2021\/09\/27\/ccny-places-3rd-in-international-overhead-imagery-hackathon\/\">CUNY Newswire<\/a>] [<a href=\"https:\/\/www.ccny.cuny.edu\/news\/ccny-places-3rd-international-overhead-imagery-hackathon\">CCNY News<\/a>]<\/p>\n\n\n\n<p><strong>August 06, 2021<\/strong>. Professor Hao Tang received an NSF CISE-MSI Grant (PI: Hao Tang; Co-PIs: Zhigang Zhu, William H Seiple) [<a href=\"https:\/\/www.nsf.gov\/awardsearch\/showAward?AWD_ID=2131186&amp;HistoricalAwards=false\">NSF Summary<\/a>] [<a href=\"https:\/\/www1.cuny.edu\/mu\/forum\/2021\/09\/10\/bmcc-led-research-on-virtual-guide-dog-for-visually-impaired-people-receives-500000-nsf-grant\/\">CUNY Wire<\/a>]<\/p>\n\n\n\n<p><strong>June 03, 2021<\/strong>. Professor Zhigang Zhu and DSE master student Jin Chen were featured on <em><strong><a href=\"https:\/\/urldefense.proofpoint.com\/v2\/url?u=https-3A__futurumcareers.com_using-2Dai-2Dand-2Dcomputer-2Dscience-2Das-2Da-2Dforce-2Dfor-2Dsocial-2Dgood&amp;d=DwMFAg&amp;c=4NmamNZG3KTnUCoC6InoLJ6KV1tbVKrkZXHRwtIMGmo&amp;r=KQbVpoJK3r1M9kJrt4YwwzaPui7fLvZ_tDOejpdiKf8&amp;m=A-ap_-sSieIIK6HSXEb0OMsqaHu0n5Q1MZw8xABVV-Q&amp;s=ZJRUXCAtWExz3kHB9B0H14XUH75U3IviH6uTundih20&amp;e=\">Futurum<\/a><\/strong>, a magazine and online platform aimed at inspiring young people to follow a career in the sciences, research and technology.<\/em><\/p>\n\n\n\n<p><strong>May 13, 2021.<\/strong> Mr. Xingye (Alex) Li. <a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2023\/08\/SnapshotNet__Self_supervised_Feature_Learning_for_Point_Cloud_Data_Segmentation_Using_Minimal_Labeled_Data-Alex-Li.pdf\">SnapshotNet: Self-supervised Feature Learning for Point Cloud Data Segmentation Using Minimal Labeled Data. Master Thesis<\/a> (Advisor: Professor Zhigang Zhu), Data Science and Engineering, The City College of New York. Congratulations!<\/p>\n\n\n\n<p><strong>May 1, 2021<\/strong>. <strong>AFOSR STTR Phase I (subaward via Intelligent Fusion Technology, Inc<\/strong>.), Robust Multi-View Target Attitude Determination Using Models, Multi-Cues and Machine Learning.  Duration: 05\/01\/2021-04\/31\/2022<\/p>\n\n\n\n<p><strong>January 13, 2021<\/strong>. <strong>AFOSR Grant<\/strong> (<strong>Award <strong>#FA9550-21-1-0082<\/strong><\/strong>) on <em>Dynamic data driven applications systems with multimodal sensing, collaborative perception and deep computing<\/em> [<a href=\"http:\/\/www1.cuny.edu\/mu\/forum\/2021\/01\/13\/three-year-air-force-grant-engages-ccny-harlem-students-in-advanced-sensing-research\/\">CUNY&nbsp;Newswire<\/a>] [<a href=\"https:\/\/www.ccny.cuny.edu\/news\/three-year-air-force-grant-engages-ccny-harlem-students-advanced-sensing-research\">CCNY News<\/a>] [<a href=\"https:\/\/www.linkedin.com\/feed\/update\/urn:li:activity:6755317102493667328\/\">GSOE LinkedIn<\/a>] [<a href=\"https:\/\/twitter.com\/CityCollegeNY\/status\/1349397923675729923\">CCNY Tweet<\/a>]<\/p>\n\n\n\n<p><strong>November 18, 2020<\/strong>. Check this out: <a href=\"http:\/\/www.guide2research.com\/\">Guide to Research<\/a>.<\/p>\n\n\n\n<p><strong>September 2, 2020.<\/strong> Two students in Professor Zhu&#8217;s <a href=\"http:\/\/ccvcl.org\/professor-zhigang-zhu\/computer-vision-and-image-processing-spring-2020\/\">Computer Vision and Image Processing<\/a> Class at the CUNY Graduate Center in Spring 2020 are the winners of this year’s student poster competition&nbsp;(with a $1000 scholarship each) of the GC CS and DS programs, based on their course projects. <em><a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2020\/09\/Winner-Announcement-Best-Poster-Competition.png\">“Social Distancing Using Deep Learning and 3D Computer Vision” By Bilal AbdulRahman and “Structure from Motion with Space Carving and MaskRCNN Segmentation” by Steven Alsheimer.<\/a><\/em> Congratulations!<\/p>\n\n\n\n<p><strong>May, 2020.<\/strong> Mr. Yaohua Chang. <a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2023\/08\/iASSIST_Capstone_Thesis_Yaohua_2020Final-version-OLD.pdf\">Multimodal Data Integration for Real-Time Indoor Navigation Using a Smartphone.<\/a> Master Thesis (Advisor: Professor Zhigang Zhu), Data Science and Engineering, The City College of New York. Congratulations!<\/p>\n\n\n\n<p><strong>August 19, 2019<\/strong>.&nbsp;Mr. GREGORY OLMSCHENK successfully defended his PhD thesis:&nbsp;<a href=\"http:\/\/ccvcl.org\/olmschenk-dissertation\">SEMI-SUPERVISED REGRESSION WITH GENERATIVE ADVERSARIAL NETWORKS USING MINIMAL LABELED DATA – CRITICAL ISSUES, NETWORKS BEHAVIORS AND APPLICATIONS<\/a>. &nbsp;<a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2019\/08\/OlmschenkDefenseSummarySlides-2019-.pdf\">Here are a few summary slides<\/a>. Congratulations!<\/p>\n\n\n\n<p><strong>May 2019.<\/strong>  Ms. Ling Zhang.  <a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2023\/08\/Ling-Zhang-Thesis.pdf\">Unsupervised Feature Learning for Point Cloud by Contrasting and Clustering with Graph Convolutional Neural Network<\/a>, Master Thesis (Advisor: Professor Zhigang Zhu), Computer Engineering, The City College of New York. Congratulations!<\/p>\n\n\n\n<p><strong>October 24, 2018.&nbsp;<\/strong> <strong>Smart&nbsp; and Accessible Transportation Hub Project in the News (<a href=\"http:\/\/www1.cuny.edu\/mu\/forum\/2018\/10\/24\/ccny-partners-develop-gps-type-app-for-the-visually-impaired\/\">CUNY Newswire<\/a> | <a href=\"https:\/\/www.ccny.cuny.edu\/news\/ccny-partners-develop-gps-type-app-visually-impaired\">CCNY News<\/a>).<\/strong> More details please see <a href=\"http:\/\/ccvcl.org\/smart-and-accessible-transportation-hub\/\"> SAT-Hub Page.<\/a><\/p>\n\n\n\n<p><strong>October 16, 2018.<\/strong>  Professor Zhigang Zhu was an invited speaker at PANEL: CROSSMODAL LEARNING IN HUMAN AND ROBOTS, University of Hamburg and the German Center for Research and Innovation (GCRI) in New York City, 16 OCTOBER 2018, GRAND CENTRAL TECH, 355 MADISION AVE, NEW YORK. The title of his presentation was <em>Multimodal Human-Machine Perception and Assistive Technology.<\/em><\/p>\n\n\n\n<p><strong>April 25, 2018.<\/strong> Our Two Capstone CREATE Teams in 2017-2018:<strong> ASSIST <\/strong>(Assistive Sensor Solution for Independent and Safe Travel, by Vishnu Nair and Manjekar Budhai) was in the <strong> <a href=\"http:\/\/spectrumlocalnews.com\/nys\/capital-region\/news\/2018\/04\/25\/college-students-showcase-technology-to-help-disabled-workers-#\">Spectrum Local News<\/a> <\/strong>(Manjekar talking  at the meeting while Vishnu testing in the field), and <strong> AVR4ASD <\/strong>(Augmented and Virtual Reality for  Individuals with Autism Spectrum Disorder, by Xinyu Xiong,  Rafael Li Chen and Yuxuan Huang) won the <strong> <a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/AVR4ASD-CREATE-2nd-place-prize-2018.pdf\">Second Place Prize of the CREATE Competition<\/a> <\/strong>(in the picture: Rafael, Xinyu and Prof. Zhigang Zhu). This is a partnership with Ms. Celina Canvalluzzi, Director of Day Services at Goodwill Industries of  Greater New York and Northern New Jersey.; More details please see<a href=\"https:\/\/www.ccny.cuny.edu\/news\/ccny-students-create-new-ways-eliminate-workplace-barriers-people-disabilities\"> a news release at CCNY.<\/a>\n\n<a href=\"https:\/\/www.ccny.cuny.edu\/news\/ccny-students-create-new-ways-eliminate-workplace-barriers-people-disabilities\"> <\/a><\/p>\n\n\n\n<p><strong>December 15, 2017<\/strong> Ms Farnaz Abtahi successfully defended her PhD thesis:  <a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2023\/08\/Farnaz-Abtahi-Thesis_Final_Revised-zz.pdf\">MULTIMODAL SENSING AND DATA PROCESSING FOR SPEAKER AND EMOTION RECOGNITION USING DEEP LEARNING MODELS WITH AUDIO, VIDEO AND BIOMEDICAL SENSORS<\/a> (Advisors: Professor Zhigang Zhu, Professor Tony Ro). Congratulations!<\/p>\n\n\n\n<p><strong>May 26, 2017<\/strong> Mr. Wei LI successfully defended his PhD thesis: <a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2023\/08\/Thesis_Wei_Revision_zz.pdf\">DEEP LEARNING BASED FACIAL COMPUTING &#8211; DATA, ALGORITHMS AND APPLICATIONS<\/a> (Advisor: Professor Zhigang Zhu). Congratulations!<\/p>\n\n\n\n<p><strong>March 1, 2017<\/strong>&nbsp;The Visual Computing Lab won a&nbsp;<strong>Department of Homeland Security Follow-On of Summer Research Team For MSIs (via ORAU DE-SC0014664),<\/strong>&nbsp;Learning, Visualization and Utilization of Crowd Analytics for Security and Navigation Using 3D Semantic Models, PI:&nbsp;<strong>Zhigang Zhu<\/strong>&nbsp;(with students: Greg Olmschenk and Vishnu Nair); Total Cost: $126,193 (DHS $45,000 + Rutgers (Jie Gong) $18,865 + CCNY $62,328); Duration: 12 months (03\/01\/2017-02\/28\/2018)<\/p>\n\n\n\n<p><strong>January 03, 2017<\/strong> Mr. Feng Hu successfully defended his PhD thesis: <a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2023\/08\/Feng_HU-Dissertation_Write_Up.pdf\">VISION-BASED ASSISTIVE INDOOR LOCALIZATION<\/a> (Advisor: Professor Zhigang Zhu). Congratulations!<\/p>\n\n\n\n<p><strong>Fall 2016 &#8211; Spring 2017<\/strong>&nbsp;Four student teams in the joint senior design class of Prof. Zhu (CS) and Prof. Jizhong Xiao (EE) won&nbsp;<strong>NYSID CREATE (Cultivating Resources for Employment with Assistive TEchnology) Grants<\/strong>&nbsp;for projects on improving employment for people with Autism Spectrum Disorder (ASD): CCNY SmartCane for assistive navigation for the blind, Panoramik for finding articles for the blind, VR4ASD for training people with ASD in taking trains, and The Fourth Dimension for task management of people with ASD.<\/p>\n\n\n\n<p><strong>September 1, 2016<\/strong>&nbsp;Prof. Zhigang Zhu is Co-PI of an&nbsp;<strong>Air Force Research Laboratory award (Award #FA8650-13-C-5800)<\/strong>&nbsp;under the&nbsp;<strong>Research Collaboration Program (RCP),<\/strong>&nbsp;&#8220;Multimodal Collaborative Sensing and Identification Using Deep Learning for Intelligence, Surveillance and Reconnaissance (ISR) Applications&#8221; (PI: Jie Wei; Co-PI: Zhigang Zhu), 9\/1\/2016 to 9\/30\/2018, renewable up to five years.<\/p>\n\n\n\n<p><strong>August 30, 2016<\/strong> Mr. Wai L. Khoo successfully defended his PhD thesis: <a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2023\/08\/WaiKhoo_Dissertation_Final.pdf\">GIVE‐ME: GAMIFICATION IN VIRTUAL ENVIRONMENTS FOR MULTIMODAL EVALUATION – A FRAMEWORK<\/a> (Advisor: Professor Zhigang Zhu). Congratulations!<\/p>\n\n\n\n<p><strong>Fall 2015 &#8211; Spring 2016<\/strong>&nbsp;Three student teams in the joint senior design class of Prof. Zhu (CS) and Prof. Jizhong Xiao (EE) won&nbsp;<strong>NYSID CREATE (Cultivating Resources for Employment with Assistive TEchnology) Grants<\/strong>&nbsp;for projects on improving employment for people with Autism Spectrum Disorder (ASD): CuraWatch for task management and monitoring, Green Jacket for ordering meals, and QR Navigation for indoor navigation.<\/p>\n\n\n\n<p><strong>May 02, 2016<\/strong>&nbsp;Three members of the City College Visual Computing Lab directed by Prof. Zhigang Zhu have been accepted to the Summer Research Team Program for Minority Serving Institutions at the DHS CCICADA at Rutgers, working on a Collaborative Vision Approach with Semantic 3D Scene Models for Scalable Crowd Behavior Analysis and Navigation Support. The team members are Dr. Zhigang Zhu (Professor of Computer Science), Greg Olmschenk (PhD student at CUNY Graduate Center), and Vishnu Nair (an undergraduate student in Computer Engineering), and the CCICADA advisor is Prof. Jie Gong at Rutgers.<\/p>\n\n\n\n<p><strong>March 29, 2016<\/strong>&nbsp;Prof. Zhigang Zhu gave an invited talk Entrepreneurship: From the Perspective of a Research Mentor, at the Innovation &amp; Business Concepts Forum, Entrepreneurial Concept Competition (ECC) Workshop, NYC Alliance.<\/p>\n\n\n\n<p><strong>March 16, 2016<\/strong>&nbsp;Prof. Zhigang Zhu gave an invited talk at Cornell Tech, New York City, on Multimodal and Alternative Perception for Assisting People in Need.<\/p>\n\n\n\n<p><strong>November 12, 2015<\/strong>&nbsp;Prof. Zhigang Zhu gave a talk Multimodal and Alternative Perception with Human-Machine Collaboration, in the CCICADA-CRG Research Talk, DHS CCICADA HQ in Piscataway, NJ.<\/p>\n\n\n\n<p><strong>October 25, 2015<\/strong>&nbsp;A team of Visual Computing Lab members (Z. Zhu, H. Tang, E. Molina, W. L. Khoo, F. Hu, W. Li) attended STEMFest, Highland View Academy, with demonstrations and a panel talk: Emerging Technologies of Mobile Computing and Gaming for Helping the Blind.<\/p>\n\n\n\n<p><strong>May 22, 2015<\/strong>&nbsp;Professor Zhu and PhD student Greg Olmschenk give a talk on Multimodal and Alternative Perception for Man-Machine Collaboration, Accessibility Research Group, IBM Research-Tokyo.<\/p>\n\n\n\n<p><strong>March 27, 2015<\/strong>&nbsp;CcvcL members (Z. Zhu, H. Tang, E. Molina and W. L. Khoo) organized a Creativity &amp; Innovation Workshop, Accessible Games, Virtual Reality and Wearable Devices for People Who Are Visually Impaired, The 8th Annual CCVIP Annual Employment and Visual Impairment Conference on Policy &amp; Practice: “Make It Happen”.<\/p>\n\n\n\n<p><strong>March 12, 2015<\/strong>&nbsp;Professor Zhu Zhu gave an invited talk onResearch and Education on Assistive Technologies for the Blind, in the New Dimensions Lecture Series at Brooklyn Technical High School.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.ccny.cuny.edu\/news\/ccny-students-create-new-ways-eliminate-workplace-barriers-people-disabilities\"><strong>May 17, 2015<\/strong> Vista Wearable Inc. is featured in the Crains New York Business. Here&#8217;s article <\/a><a href=\"http:\/\/www.crainsnewyork.com\/article\/20150517\/TECHNOLOGY\/150519896\/its-all-wearable-tech-but-will-people-want-to-wear-it\">(link)<\/a> Here&#8217;s the feature <a href=\"http:\/\/www.crainsnewyork.com\/gallery\/20150517\/FEATURES01\/516009999\/8\">(link)<\/a><\/p>\n\n\n\n<p><strong>May 15, 2015<\/strong> Mr. Edgardo Molina successfully defended his PhD thesis: <a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2023\/08\/edgardo-molina-thesis-final.pdf\">PANORAMA GENERATION FOR STEREOSCOPIC VISUALIZATION OF LARGE SCALE<\/a> (Advisor: Professor Zhigang Zhu). Now is the lead instructor for CUNY Tech Prep, after being CEO and Co-Founder of Vista Wearable, Inc. Congratulations!<\/p>\n\n\n\n<p><strong>April 30, 2015<\/strong>&nbsp;A CS\/CpE\/EE Joint Senior Design Team won the 2015 Social Innovation Prize ($30K) from the Zahn Innovation Center. Project Title: HAST: Health and Support Technology for Families using Open Source Wearable Devices. Team members (Joint Senior Design Class Students): Benjamin Tan (EE), Bin Xu (EE), Ni Yao (CpE) and Xue Bin Zhao (CS). Mentors: Professors Jizhong Xiao and Zhigang Zhu.<\/p>\n\n\n\n<p><strong>April 9, 2015<\/strong>&nbsp;Three members of the City College Visual Computing Lab directed by Prof. Zhigang Zhu have been accepted to the Summer Research Team Program for Minority Serving Institutions at the DHS CCICADA at Rutgers. They are Dr. Hao Tang (assistant professor at BMCC, PhD graduate from Prof. Zhu’s group), Greg Olmschenk (Prof. Zhu’s current PhD student), and David Zeng (an undergraduate student in Prof. Zhu’s Data Structures class).<\/p>\n\n\n\n<p><strong>Feb 21, 2015<\/strong>&nbsp;Mr. Harith Morgan, a high school student at Brooklyn Tech, won the 2015 REM Best Poster Award during the 2015 EMERGING RESEARCHERS NATIONAL (ERN 2015) CONFERENCE IN STEM in Washington DC. Harith was a research participant in the 2014-2015 EFRI-REM Summer Research Program at CCNY.<\/p>\n\n\n\n<p><strong>Jan 1, 2015<\/strong>&nbsp;City College will continue the NSF EFRI Research Experience and Mentoring (EFRI-REM) program for the fourth year on Multimodal Alternative Perception for Visually Impaired People (MAP-4-VIP). This is a supplement to the existing $2M NSF EFRI-M3C grant, with $100K, $120K, $100K and $100K for years 2012, 2013, 2014 and 2015 respectively, to attract, support and train underrepresented students in cutting-edge research in STEM fields:&nbsp;<a href=\"http:\/\/www.nsf.gov\/awardsearch\/showAward?AWD_ID=1137172\">(link)<\/a><\/p>\n\n\n\n<p><strong>March 20, 2014<\/strong>&nbsp;Looking for applicants to the&nbsp;<a href=\"..\/~khoo\/REM2014.1.html\">NSF EFRI-REM 2014 program.<\/a><\/p>\n\n\n\n<p><strong>May 20, 2013<\/strong> Professor Zhigang Zhu received <a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/\/letter-president-award-for-excellence-2013.pdf\">President’s Award for Excellence,<\/a> The City College of New York, in the inaugural year of the President&#8217;s Awards.<\/p>\n\n\n\n<p><strong>May 18, 2013<\/strong>&nbsp;Congratulations to Mr. Wai Khoo on receiving GC Provost&#8217;s Digital Incubator Grant of $1,000.<\/p>\n\n\n\n<p><strong>May 18, 2013<\/strong>&nbsp;Congratulations to Mr. Greg Olmschenk on receiving PSC-CUNY award of $12,000, with Prof. Zhigang Zhu.<\/p>\n\n\n\n<p><strong>May 18, 2013<\/strong>&nbsp;Congratulations to Dr. Hao Tang on receiving PSC-CUNY award of $6,000.<\/p>\n\n\n\n<p><strong>May 04, 2013<\/strong>&nbsp;City College will continue the NSF EFRI Research Experience and Mentoring (EFRI-REM) program for the second year on Multimodal Alternative Perception for Visually Impaired People (MAP-4-VIP). PIs: Zhigang Zhu, Tony Ro and YingLi Tian. This is supplement to the existing $2M NSF EFRI-M3C grant, with $100K and $120K for year 1012 and year 2013, respectively, to attract, support and train underrepresented students in cutting-edge research in STEM fields:<a href=\"http:\/\/www.nsf.gov\/awardsearch\/showAward?AWD_ID=1137172\">http:\/\/www.nsf.gov\/awardsearch\/showAward?AWD_ID=1137172<\/a><\/p>\n\n\n\n<p><strong>March 19, 2013<\/strong>&nbsp;Professors Zhigang Zhu (CS), Yingli Tian (EE) and Tony Ro (Psy) are co-chairs of the IEEE Workshop on Multimodal and Alternative Perception for Visually Impaired People (MAP4VIP), July 15th, 2003, San Jose, USA, in conjunction with ICME 2013.&nbsp;<a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/MAP4VIP\/\">http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/MAP4VIP\/<\/a>&nbsp;This workshop is financially sponsored by NSF (detail:<a href=\"http:\/\/nsf.gov\/awardsearch\/showAward?AWD_ID=1327236\">http:\/\/nsf.gov\/awardsearch\/showAward?AWD_ID=1327236<\/a>&nbsp;), Microsoft Research and Grove School of Engineering at CCNY.<\/p>\n\n\n\n<p><strong>Feb 11, 2013<\/strong>&nbsp;Professors Zhigang Zhu (CS), Jizhong Xiao (EE)and Tony Ro (Psy) won a three-year grant from National Collegiate Inventors and Innovators Alliance (NCIIA) Course and Program for strengthening interdisciplinary undergraduate senior designs. The theme is “Human and Machine Intelligence &#8211; Perception, Computation and Action”, and the grant period is June 1, 2013 to August 31, 2016&nbsp;<a href=\"http:\/\/nciia.org\/node\/1990\">http:\/\/nciia.org\/node\/1990<\/a><\/p>\n\n\n\n<p><strong>December 06, 2012<\/strong> Mr. Hao Tang successfully defensed his PhD thesis: 3D SCENE MODELING AND UNDERSTANDING FROM IMAGE SEQUENCES (Advisor: Professor Zhigang Zhu). Now he is an Assistant Professor at the Borough of Manhattan Community College, The City University of New York. Congratulations!<\/p>\n\n\n\n<p><strong>November 06, 2012<\/strong> Mr. Tao Wang successfully defensed his PhD thesis: <a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2023\/08\/PhD_Dissertation_Tao_Wang-draft.pdf\">AN ADAPTIVE AND INTEGRATED MULTIMODAL SENSING AND PROCESSING FRAMEWORK FOR LONG RANGE MOVING OBJECT DETECTION AND CLASSIFICATION<\/a> (Advisor: Professor Zhigang Zhu). Now he is a Senior Software Engineer at BAE Systems. Congratulations!<\/p>\n\n\n\n<p><strong>September 2012<\/strong>&nbsp;Mr. Edgardo Molina received the Khan and Lyons Scholarship for Ph.D. Student in the Grove School of Engineering, The City College of New York. Congratulations!<\/p>\n\n\n\n<p><strong>August 27, 2012<\/strong>&nbsp;PhD students Ms Farnaz Abtahi, Mr. Feng Hu and Mr. Martin Goldberg joined the City College Visual Computing Lab. Welcome!<\/p>\n\n\n\n<p><strong>August 17, 2012<\/strong>&nbsp;Professor Jizhong Xiao (EE) and Professor Zhigang Zhu (CS) won a 5-year NSF grant developing and running a joint Senior Design Program on Assistive Technology to Aid Visually Impaired People in CS, CpE and EE.&nbsp;<a href=\"http:\/\/www.nsf.gov\/awardsearch\/showAward?AWD_ID=1160046\">http:\/\/www.nsf.gov\/awardsearch\/showAward?AWD_ID=1160046<\/a><\/p>\n\n\n\n<p><strong>August 7, 2012<\/strong>&nbsp;Prof. Zhigang Zhu named the&nbsp;<strong>Herbert G. Kayser Chair Professor of Computer Science<\/strong>&nbsp;in the Grove School of Engineering, the City College of New York. This is a recognition of the academic achievement of the entire CcvcL team.<\/p>\n\n\n\n<p><strong>August 1, 2012<\/strong>&nbsp;Prof. Guihua Liu from Southwest University of Science and Technology (China) joined the Lab as a visiting research scholar. Welcome!<\/p>\n\n\n\n<p><strong>June 19, 2012<\/strong>&nbsp;CcvcL won the&nbsp;<a href=\"http:\/\/nsf.gov\/awardsearch\/showAward.do?AwardNumber=1243737\">NSF I-Corps Award: Transforming 2D Video into an Interactive 3D Viewing Experience<\/a>&nbsp;(PI: Zhigang Zhu, EL: Edgardo Molina, IMs: Peter Chang and John Blaho)<\/p>\n\n\n\n<p><strong>June 4, 2012<\/strong>&nbsp;The new&nbsp;<a href=\"http:\/\/www.nsf.gov\/pubs\/2012\/nsf12052\/nsf12052.jsp\">NSF EFRI-REM<\/a>&nbsp;program on Multimodal Alternative Perception for Visually Impaired People (MAP-4-VIP) at CCNY started.&nbsp;<em>PIs:<\/em>&nbsp;Zhigang Zhu, Tony Ro and YingLi Tian.&nbsp;<em>PhD Student Coordinators:<\/em>&nbsp;Wai L. Khoo, Edgardo Molina, Hao Tang.&nbsp;<em>PhD Student Mentors:<\/em>&nbsp;Lei Ai, Psy, Wai L. Khoo, CS, Edgardo Molina, CS, Hao Tang, CS, Tao Wang, CS, Kelly Webster, Psy, Xiaodong Yang, EE, Chucai Yi, EE&nbsp;<em>Research Assistants:<\/em>&nbsp;Alpha Diallo, CS, Martin Goldberg, CS, Joey Knapp, CS, Carol Mazuera, EE, Frank Palmer, CpE and Math, Jessica Vargas, CS and Psy, Margaret A. Vincent, Psy.&nbsp;<em>Observers:<\/em>Christine Bharosi, Kalah Dolmen, Jim Waters (NYISE), Ben Humphreys (CCNY), Joey Pan (Bronx Science).&nbsp;<strong>This is a truly mulch-disciplinary team work with a pipeline training model.<\/strong><\/p>\n\n\n\n<p><strong>May 3, 2012<\/strong>&nbsp;Our 2011-2012 Capstone Team V.I.S.T.A. Won the&nbsp;<a href=\"http:\/\/www1.cuny.edu\/mu\/forum\/2012\/05\/18\/ccny-announces-winner-of-50000-kaylie-prize-for-entrepreneurship\/\">$50000 Kaylie Prize<\/a>&nbsp;(See also The City College&nbsp;<a href=\"http:\/\/entrepreneurship.ccny.cuny.edu\/kaylieprize\">Kaylie Prize for Entrepreneurship<\/a>&nbsp;). The team, &#8220;VISTA Wearable,&#8221; includes four senior computer engineering majors – Daniel Zuleta, Frank Palmer, Cindy Rodriguez, and Javier Montesino – and doctoral student in psychology, Lei Ai. Professor of Computer Science Zhigang Zhu and Professor of Psychology Tony Ro advised the team.<\/p>\n\n\n\n<p>We are looking for highly motivated PhD student as a research assistant working on multimodal sensor design and machine learning. For more information, please visit&nbsp;<a href=\"http:\/\/www.nsf.gov\/awardsearch\/showAward.do?AwardNumber=1137172\">an abstract<\/a>&nbsp;of the NSF EFRI Research Award, and&nbsp;<a href=\"http:\/\/www.ccny.cuny.edu\/news\/CCNY-led-Research-Could-Lead-to-Wearable-Sensors-for-Blind.cfm\">a news post<\/a>&nbsp;about the project. And contact&nbsp;<a href=\"http:\/\/www-cs.ccny.cuny.edu\/~zhu\/\">Dr. Zhigang Zhu.<\/a><\/p>\n\n\n\n<p>Professor Zhigang Zhu as PI, along with Co-PI&#8217;s Tony Ro (Psychology, CCNY), Ying Li Tian (EE, CCNY), Kok-Meng Lee (Georgia Tech) and Boris Prilutsky (Georgia Tech) have been awarded a 4 year NSF EFRI award under the topic Man, Machine and Motor Control (M3C) for their proposal: Mobility Skill Acquisition and Learning through Alternative and Multimodal Perception for Visually Impaired People.<a href=\"http:\/\/www.nsf.gov\/awardsearch\/showAward.do?AwardNumber=1137172\">[Read more]<\/a><\/p>\n\n\n\n<p>Professor Zhigang Zhu with Professor Jizhong Xiao have received a NCIAA grant for a senior design course on: Wearable Multimodal Wayfinding Techniques for Blind and Visually Impaired People.&nbsp;<a href=\"http:\/\/nciia.org\/node\/1619\">[Read more]<\/a><\/p>\n\n\n\n<p>Professor Zhigang Zhu has been selected as a Faculty Fellow for the 2011 Air Force Summer Faculty Fellowship Program (SFFP). He will bring two PhD students (Mr. Edgardo Molina and Mr. Tao Wang) to work with him at the Air Force Research Laboratory.<\/p>\n\n\n\n<p>Two Master students, Mr. Jian-Hong Li, Mr. Martin Goldberg and one undergraduate student Mr. Frank Palmer joined the Visual Computing Laboratory. Welcome!<\/p>\n\n\n\n<p>PhD student Mr. Hao Tang just returned from an internship at SRI International Sarnoff. Welcome back!<\/p>\n\n\n\n<p>PhD student Wai L. Khoo is teaching CS212: Data Structures during the Summer 2011 semester.<\/p>\n\n\n\n<p>Mr. Jiang-Hong Li has been selected as a summer intern in 2011 at IBM Research China. Congratulations!<\/p>\n\n\n\n<p>PhD students Tao Wang and Hao Tang successfully passed their second exams (literature reviews). Congratulations!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>November 09, 2021. Lab Member Steven Alsheimer, a master student in the Data Science Program at the Graduate Center, will be a Data Scientist with Canon, starting by the end&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/posts\/338"}],"collection":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/comments?post=338"}],"version-history":[{"count":33,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/posts\/338\/revisions"}],"predecessor-version":[{"id":3354,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/posts\/338\/revisions\/3354"}],"wp:attachment":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/media?parent=338"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/categories?post=338"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/tags?post=338"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}