{"id":2377,"date":"2022-01-24T20:53:05","date_gmt":"2022-01-25T01:53:05","guid":{"rendered":"http:\/\/ccvcl.org\/?page_id=2377"},"modified":"2022-01-24T20:53:34","modified_gmt":"2022-01-25T01:53:34","slug":"csc-471-spring-2022-assignment-3","status":"publish","type":"page","link":"http:\/\/ccvcl.org\/professor-zhigang-zhu\/csc-471-computer-vision-spring-2022\/csc-471-spring-2022-assignment-3\/","title":{"rendered":"CSc 471 Spring 2022 -Assignment 3"},"content":{"rendered":"\n<p>Computer Science – The City College of New York<br><strong>Computer Vision<br>Assignment 3 ( Deadline: <em>03\/27 Sunday before midnight<\/em> )<\/strong><br>===============================================================<br><strong><em>(Those marked with * are optional for extra credits)<\/em><\/strong><\/p>\n\n\n\n<p>Note:  Turn in a PDF document containing a list  of your .m files (not the code itself),  images showing the results of your experiments such as images, tables, plots, and an analysis of the results. All the writings must be soft copies in print and be sent to Prof. Zhu via email Zhigang Zhu &lt;ds.zhu.ccny@gmail.com>.  For the programming part, <strong>send ONLY your source code  by email<\/strong>; please don’t send in your images and executable (even if you use C++).  You are responsible for the loss of your submissions if you don’t write  “<strong>CSC 471 Computer Vision Assignment 3<\/strong>” in the subject of your email. Do write your name and ID (last four digits) in both both of your report and the code. Please don’t zip your report with your code and other files; send me the report in a separate PDF file. The rest can be in a zipped file.<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p>1   (Camera Models- 30 points)  Prove that the vector from the viewpoint of a pinhole camera to the vanishing point (which is a point on the image plane) of a set of 3D parallel lines in space is parallel to the direction of that set parallel lines. Please show steps of your proof.<\/p>\n\n\n\n<p><strong>Hint:<\/strong>&nbsp;You can either use geometric reasoning or algebraic calculation.&nbsp;<\/p>\n\n\n\n<p>If you choose to use geometric reasoning, you can use the fact that the projection of a 3D line in space is the intersection of its “interpretation plane” with the image plane.&nbsp; Here the interpretation plane (IP) is a plane passing through the 3D line and the center of projection (viewpoint) of the camera.&nbsp; Also, the interpretation planes of two parallel lines intersect in a line passing through the viewpoint, and the intersection line is parallel to the parallel lines.<\/p>\n\n\n\n<p>If you select to use algebraic calculation, you may use the parametric representation of a 3D line: P = P0 +tV, where P= (X,Y,Z)<sup>T<\/sup>&nbsp;is any point on the line (here&nbsp;&nbsp;<sup>T<\/sup>&nbsp;denote for transpose),&nbsp;&nbsp; P0 = (X0,Y0,Z0)<sup>T<\/sup>&nbsp;is a given fixed point on the line, vector V = (a,b,c)<sup>T<\/sup>&nbsp;represents the direction of the line, and t is the scalar parameter that controls the distance (with sign) between P and P0.<\/p>\n\n\n\n<p>2. (Camera Models- 20 points) Show that relation between any image point (xim, yim)<sup>T<\/sup>&nbsp; (in the form of&nbsp;(x1,x2,x3)<sup>T<\/sup>&nbsp;in projective space ) of a planar surface in 3D space and its corresponding point (Xw, Yw, Zw)<sup>T<\/sup>&nbsp;on the plane in 3D space can be represented by a 3×3 matrix. You should start from the general form of the camera model (x1,x2,x3)<sup>T<\/sup>&nbsp;= M<sub>int<\/sub>M<sub>ext<\/sub>(Xw, Yw, Zw, 1)<sup>T<\/sup>, where the image center (ox, oy), the focal length f, the scaling factors( sx and sy), &nbsp;the rotation matrix R and the translation vector T are all unknown. Note that in the course slides and the lecture notes, I used a simplified model of the perspective project by assuming ox and oy are known and sx = sy =1, and only discussed the special cases of a plane. So you cannot directly copy those equations I used.&nbsp; Instead you should use the general form of the projective matrix, and the&nbsp; general form of a plane n<sub>x<\/sub>&nbsp;X<sub>w<\/sub>&nbsp;+ n<sub>y<\/sub>&nbsp;Y<sub>w<\/sub>&nbsp;+ n<sub>z<\/sub>&nbsp;Z<sub>w<\/sub>&nbsp;&nbsp;= d.&nbsp;<\/p>\n\n\n\n<p>3.  (Calibration- 50 points )  Prove the Orthocenter Theorem by geometric arguments: Let T be the triangle on the image plane defined by the three vanishing points of three mutually orthogonal sets of parallel lines in space. Then the image center is the orthocenter of the triangle T (i.e., the common intersection of the three altitudes.  Note that you are asked to prove the Orthocenter Theorem rather than that the orthocenter itself as the common interaction of the three altitudes, which you can use as a fact.<br>(1)    Basic proof: use the result of Question 1, assuming the aspect ratio of the camera is 1. (20 points)<br>(2)    If you do not know the  focal length of the camera, can you still find the image center using the Orthocenter Theorem? Can you further estimate the focal length? For both questions, please <strong>show why (and then how) or why not.<\/strong> (20 points)<br>(3)    If you do not know the aspect ratio of the camera, can you still find the image center using the Orthocenter Theorem? <strong>Show why or why not.<\/strong> (10 points)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Computer Science – The City College of New YorkComputer VisionAssignment 3 ( Deadline: 03\/27 Sunday before midnight )===============================================================(Those marked with * are optional for extra credits) Note:  Turn in a PDF document&hellip;<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":2279,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-templates\/fullwidth.php","meta":{"footnotes":""},"_links":{"self":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/2377"}],"collection":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/comments?post=2377"}],"version-history":[{"count":3,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/2377\/revisions"}],"predecessor-version":[{"id":2380,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/2377\/revisions\/2380"}],"up":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/2279"}],"wp:attachment":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/media?parent=2377"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}