{"id":2875,"date":"2023-01-18T16:40:14","date_gmt":"2023-01-18T21:40:14","guid":{"rendered":"http:\/\/ccvcl.org\/?page_id=2875"},"modified":"2023-04-26T22:49:40","modified_gmt":"2023-04-27T02:49:40","slug":"computer-vision-spring-2023-assignment-1","status":"publish","type":"page","link":"http:\/\/ccvcl.org\/computer-vision-spring-2023-assignment-1\/","title":{"rendered":"Computer Vision Spring 2023 – Assignment 1"},"content":{"rendered":"\n<p>Computer Science – The CUNY Graduate Center<br><strong><strong>CSC 83020 &#8211; 01&nbsp; (55719) Human &amp; Computer Vision with Advanced Topics<\/strong><br>Assignment 1 ( Deadline: 02\/21 Tuesday before midnight)<\/strong><br>===============================================================<br>Note: All the writings of your assignment must be in a “soft” copy (in a single PDF file)&nbsp; by sending&nbsp; to Prof. Zhu &lt;cv.zhu.ccny@gmail.com&gt; via an email attachment. You are responsible for the lose of your submissions if you don’t include&nbsp; “<strong><strong>CSC 83020 &#8211; 01&nbsp;<\/strong>″&nbsp;<\/strong>(exactly) in the&nbsp;<strong>subject&nbsp;<\/strong>of your email. For your programming part, in addition to the writing report including in the PDF file mentioned above, please also send your source code in a separate file (zipped if having multiple files in their original formats); please don’t format them into PDF or Word formats. Please don’t send in your images and executable.&nbsp; You may want to include images, tables, etc. inside your report as they show results of your work.<\/p>\n\n\n\n<p>Please don’t forget to write your name and ID (last four digits) in both your report and the code, right after the title (if any) of your report. Then under your name, please write this statement:<br><span class=\"has-inline-color has-vivid-green-cyan-color\">“The work in this assignment is my own. Any outside sources have been properly cited.”<\/span><br><span class=\"has-inline-color has-vivid-red-color\">Without writing this statement, you will not be able to get any score.<\/span><\/p>\n\n\n\n<p><strong>A. Writing Assignments (10×3 = 30 points)<\/strong><\/p>\n\n\n\n<ol><li>How does an image change (including at least, objects’ sizes in the image, field of view, etc.) if the focal length of a pinhole camera is varied?<\/li><li>Give an intuitive explanation of the reason why a pinhole camera has an infinite depth of field, meaning everything is in focus regardless of the distances of the objects, and why a thin lens camera model will cause blurs on images.<\/li><li>Prove that, in the pinhole camera model, three collinear points (i.e., they lie on a line)&nbsp; in 3D space are imaged into three collinear points on the image plane. You may either use geometric reasoning (with line drawings) or algebra deduction (using equations).<\/li><\/ol>\n\n\n\n<p><strong>B. Programming&nbsp; Assignments on basic image transformation (Matlab preferred – here is a&nbsp;<a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2019\/09\/matlab.pdf\">quick matlab tutorial<\/a>. &nbsp;You may use C++ or Java if you like, but you may need to bring your&nbsp; own machine to me in my office hours to run your programs when I ask you. )<\/strong>&nbsp;<strong><span class=\"has-inline-color has-vivid-red-color\">(total 70 points)<\/span><\/strong><br><br>In this small project, you are going to use Matlab to read, manipulate and write image data. The purpose of the project is to make you familiar with the basic digital image formations. No matter what is the programming language you will use, please don’t use the built-in functions for image processing or computer vision, but rather you should write your transformation functions and array operations. Your program should do the following things:<\/p>\n\n\n\n<ol><li><strong>[5 points]&nbsp;<\/strong>Read in a color image C1(x,y) = (R(x,y), G(x,y), B(x,y)) in Windows BMP format, and display it.<\/li><li><strong>[5 points]<\/strong>&nbsp;Display the images of the three color components, R(x,y), G(x,y) and B(x,y), separately. You should display three black-white-like images.<\/li><li><strong>[5 points]<\/strong>&nbsp;Generate an intensity image I(x,y) and display it. You should use the equation I = 0.299R + 0.587G + 0.114B (the NTSC standard for luminance) and tell us what are the differences of the intensity image thus generated from the one using a simple average of the R, G and B components. Please be specific by analyzing your quantitative results rather than just speculation by looking at images.<\/li><li><strong>[10 points]<\/strong>&nbsp;The original intensity image should have K = 256 gray levels.&nbsp; Please uniformly quantize this image into different K levels ( with K=4, 16, 32, 64).&nbsp; As an example,&nbsp; when K=2,&nbsp; pixels whose values are below 128 are turned to 0,&nbsp; otherwise to 255.&nbsp; Display the four quantized images with four different K levels&nbsp; and tell us&nbsp; how the images still look like the original ones.<\/li><li><strong>[10 points]<\/strong>&nbsp;Quantize&nbsp; the original three-band color image C1(x,y) into color images CK(x,y)= (R'(x,y), G'(x,y), B'(x,y)) (with uniform intervals for each band having K levels) , and display them. You may choose K=2 and 4 (for each band).&nbsp; Do they have any advantages in viewing and\/or in computer processing (e.g. segmentation)? Please be specific on your chosen image(s).<\/li><li><strong>[10 points]<\/strong>&nbsp;Please transform the original RGB image into (1) an HSI image, and (2) a YUV image, and display each band individually into a gray scale image. You may use the equation on the slides of I-4 for YUV, but you will have to figure out what are the equations from RGB to HSI. Please give some intuitive explanation of each band, and their relations if any.<\/li><li><strong>[25 points]<\/strong>. Suppose you apply the Sobel operator to each of the RGB color bands of a color image.&nbsp; How might you combine these results into a color edge detector<strong> (5 points)<\/strong>?&nbsp; Do the resulting edge results differ from the gray scale results?&nbsp; How and why <strong>(5 points)<\/strong>? You may compare the edge maps of the intensity image (of the color image), the gray-scale edge map that are the combination of the three edge maps from three color bands, or a real color edge map that edge points have colors <strong>(5 points)<\/strong>. Please discuss their similarities and differences, and how each of them can be used for image enhancement or feature extraction<strong> (5 points).<\/strong> Note that you want to first generate gradient maps and then using thresholding to generate edge maps.&nbsp; In the end, please try to generate a color sketch of an image, such as the ID image of Prof. Zhu. You may also consider local, adaptive thresholding in generating a color edge map <strong>(5 points)<\/strong>.<\/li><\/ol>\n\n\n\n<p><strong>Please for each of the above, provide your analysis \/ observations \/ conclusions, rather than just show the experimental results in images and\/or charts.<\/strong>&nbsp;I have provided a piece of&nbsp;<a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/CSCI6716-2018s\/Homework\/ImageFormat.m\">starting code<\/a>&nbsp;for you to use, in which Questions 1 and 2 have been done. You may use&nbsp;<a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2019\/09\/IDPicture.png\">Prof. Zhu’s old ID picture<\/a>&nbsp;for testing your algorithm.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Computer Science – The CUNY Graduate CenterCSC 83020 &#8211; 01&nbsp; (55719) Human &amp; Computer Vision with Advanced TopicsAssignment 1 ( Deadline: 02\/21 Tuesday before midnight)===============================================================Note: All the writings of your&hellip;<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-templates\/fullwidth.php","meta":{"footnotes":""},"_links":{"self":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/2875"}],"collection":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/comments?post=2875"}],"version-history":[{"count":6,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/2875\/revisions"}],"predecessor-version":[{"id":3122,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/2875\/revisions\/3122"}],"wp:attachment":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/media?parent=2875"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}