{"id":3009,"date":"2023-02-27T13:15:19","date_gmt":"2023-02-27T18:15:19","guid":{"rendered":"http:\/\/ccvcl.org\/?page_id=3009"},"modified":"2023-04-26T22:45:25","modified_gmt":"2023-04-27T02:45:25","slug":"csc212-assignment-4-spring-2023","status":"publish","type":"page","link":"http:\/\/ccvcl.org\/csc212-assignment-4-spring-2023\/","title":{"rendered":"CSc212 Assignment 4 &#8211; Spring 2023"},"content":{"rendered":"\n<p><strong>Computer Science&nbsp;City College of New York<\/strong><br>&nbsp; CSc21200&nbsp;Data Structures, Spring 2023<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<h2 class=\"wp-block-heading\">Programming Assignment 4&nbsp; (Chapter 5) – Revised sequence class with the Linked List Toolkit<\/h2>\n\n\n\n<h3 class=\"wp-block-heading\">Adapted from Data Structures and Other Objects Using C++&nbsp;<br><strong>by&nbsp;<a href=\"http:\/\/www.cs.colorado.edu\/~main\/\">Michael Main&nbsp;<\/a>and&nbsp;<a href=\"http:\/\/cseweb.ucsd.edu\/users\/savitch\/\">Walter Savitch<\/a><\/strong><\/h3>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<ul><li><strong>The Assignment:<\/strong>&nbsp;You will implement and test a revised sequence class that uses a linked list to store the items.<\/li><li><strong>Purposes:&nbsp;<\/strong>Ensure that you can write a small class that uses the linked list toolkit to create and manipulate a linked list.<\/li><li><strong>Before Starting:<\/strong>&nbsp;Read all of Chapter 5, with particular attention to Sections 5.3 and 5.4.<\/li><li><strong>Due Date: Thursday, March&nbsp; 16, 2023<\/strong>. If you have problems, late work will be accepted before Friday with no penalties. Late work may be submitted on&nbsp; Saturday or Sunday with 5% penalty per day. No work will be accepted after Sunday.<\/li><li><strong>How to Turn In:<\/strong>&nbsp;Files to be submitted: source code (*.cpp, *.cxx, *.h, see below for details)&nbsp; and the text file (a *.txt file or *.pdf file) showing the running output results using seq_ex3.cxx. Please don’t send your excutable files. Please submit your files to&nbsp;<a href=\"mailto:ds.zhu.ccny@gmail.com\">ds.zhu.ccny@gmail.com<\/a>, with the subject line “<strong>CSc212 Assignment 4<\/strong>“.<\/li><li><strong>Integrity Policy:&nbsp;<\/strong>Please don’t forget to write your name and ID (last four digits) on top of each of your files (see below for files you need to turn in). Then under your name, please write this statement:&nbsp;<span class=\"has-inline-color has-vivid-green-cyan-color\">“The work in this assignment is my own. Any outside sources have been properly cited.”<\/span>&nbsp;<span class=\"has-inline-color has-vivid-red-color\">Without writing this statement, you may not be able to get any score.<\/span><\/li><li><strong>Files that you must write and turn in:<\/strong><\/li><\/ul>\n\n\n\n<ol><li>sequence3.h:&nbsp;The header file for the new sequence class. Actually, you don’t have to write much of this file. Just start with&nbsp;<a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/CSc212\/Assignments\/sequence3.h\">our version&nbsp;<\/a>and add your name and other information at the top. If some of your member functions are implemented as inline functions, then you may put those implementations in this file too. By the way, you might want to compare this header file with your first sequence header file&nbsp;<a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/CSc212\/Assignments\/sequence1.h\">(sequence1.h)&nbsp;<\/a>, and second sequence header file&nbsp;<a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/CSc212\/Assignments\/sequence2.h\">(sequence2.h)<\/a>. The linked list version no longer has a CAPACITY constant nor a DEFAULT_CAPACITY constant because the items are stored on a linked list instead of an array.<\/li><li>sequence3.cxx:&nbsp;The implementation file for the new sequence class. You will write all of this file, which will have the invariant of the sequence class, the implementations of all the member functions of the sequence class, and the Big-Os of these functions.<\/li><li><a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/CSc212\/Assignments\/node1.h\">node1.h<\/a>&nbsp;and&nbsp;<a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/CSc212\/Assignments\/node1.cxx\">node1.cxx:<\/a>&nbsp;Copy these files to your sub-directory. They contain the linked list toolkit from Section 5.2. You may use these files without changing them. However we only provide the documentation for the function list_piece (see Self-Test Exercise 17 on page 239). You may need to write an implementation of this function if you are going to use it in writing your copy constructor and overloading your assignment operator. If you do make changes, please turn them in.<\/li><\/ol>\n\n\n\n<p><strong>Other files that you may find helpful:<\/strong><\/p>\n\n\n\n<ol><li><a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/CSc212\/Assignments\/sequence_test.cxx\">sequence_test.cxx<\/a>: This is the same interactive test program that you used with the earlier sequences. This is exactly what we expect for the&nbsp; information hiding of the class – the users do not need to know how the class is implemented ( both the member variables and the functions) as far as the interfaces (the prototype of the member functions)&nbsp; remain the same. So if you want to use the test program with the new sequence, the only thing you need to do is to copy it to your directory and open it with your editor. Then change the statements<\/li><li><a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/CSc212\/Assignments\/seq_ex3.cxx\">seq_ex3.cxx:<\/a>&nbsp;A non-interactive test program that will be used to grade the correctness of your new sequence class. The points given by the program will only be served as a reference; we are going to look into your code and your analysis ( in the form of comment lines) for actual grading.<\/li><\/ol>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<h3 class=\"wp-block-heading\">The sequence Class Using a Linked List<br>Discussion of the Assignment<\/h3>\n\n\n\n<p>Your sequence class for this assignment will differ from the your previous sequence in the following ways:<\/p>\n\n\n\n<ul><li>The sequence’s items are now stored on a linked list. The head pointer of the linked list is a private member variable of the sequence class. I suggest that you also have a tail pointer as an additional private member variable of the sequence class. The reason for the tail pointer is explained in Section 5.4 of the textbook.<\/li><li>Because you are dynamically allocation memory within your sequence class, you will need to define a copy constructor, an assignment operator, and a destructor. You need to pay special attention to the value semantics of your new sequence class – you need not only to make a copy of the linked list, but also need to place the node pointers correctly. Please refer to page 260 for more detailed discussions on the value semantics.<\/li><\/ul>\n\n\n\n<p>Start by declaring the new sequence’s private member variables in sequence3.h. You might try declaring these variables yourself, and then compare your solution with the suggestion in Section 5.4.<\/p>\n\n\n\n<p>Once again, do your work in small pieces. For example, my first version of the sequence had only a constructor, start, insert, advance, and current. My other member functions started out as stubs.<\/p>\n\n\n\n<p>Design a sequence class using a linked list could be little bit more complicated than using an array. Therefore, I recommend you to draw an example linked list such as the one shown in page 260 of the textbook when you are writing code for each member function. Always remember to show all the member variables in order to remind you&nbsp; making proper changes of them. You need to place the cursor and the precursor at various locations, head, tail and other places. Note that the sequence could be empty, and cursor and\/or precursor could be NULL, even when the sequence is NOT empty. With the help of small drawings, jobs will be much easier!<\/p>\n\n\n\n<p>Use the interactive test program and the debugger to track down errors in your implementation. If you have an error,&nbsp;<em>do not start making changes until you have identified the cause of the error.<\/em>&nbsp;If you come to me&nbsp; for help, we will always ask you to do the following:<\/p>\n\n\n\n<ol><li>Show us the invariant that describes how your private member variables implement the sequence class.<\/li><li>Use the debugger to show us the problem!<\/li><\/ol>\n\n\n\n<p><strong>For those working in the Unix operating system:<\/strong>&nbsp;Spend some time writing your make file. A correct Unix makefile will save you time. Make sure that each compilation command in the make file has a TAB as the first character. In order to insert a TAB using emacs, type Ctrl-Q and then press the TAB key. Or, if you are working from a modem where the TAB key is disabled, you can type<br>ESCAPE x quoted-insert RETURN TAB<\/p>\n\n\n\n<p><strong>Run Time Analysis of the sequence classes and grading rules<\/strong><\/p>\n\n\n\n<p>We will use the number of items in a bag as the input size n of the project.&nbsp; Please give the Big-O of each function in your implementation, and compare them with the corresponding functions of the sequence using a dynamic array.&nbsp;You should write the time analysis in the comment lines of each function.&nbsp;&nbsp;The breakdowns of points (of 100) will be the followings:<\/p>\n\n\n\n<ul><li>Basis points (70) if your implementation passes the <em>seq_ex3<\/em> exam<\/li><li>Invariant of the class (5 points)<\/li><li>Run time analysis (15 points)<\/li><li>Other implementation details such as compiling warning, code styles and efficiency, etc. (10 points) &nbsp;<\/li><\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Computer Science&nbsp;City College of New York&nbsp; CSc21200&nbsp;Data Structures, Spring 2023 Programming Assignment 4&nbsp; (Chapter 5) – Revised sequence class with the Linked List Toolkit Adapted from Data Structures and Other&hellip;<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-templates\/fullwidth.php","meta":{"footnotes":""},"_links":{"self":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/3009"}],"collection":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/comments?post=3009"}],"version-history":[{"count":2,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/3009\/revisions"}],"predecessor-version":[{"id":3117,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/3009\/revisions\/3117"}],"wp:attachment":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/media?parent=3009"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}