{"id":3396,"date":"2023-08-22T20:23:28","date_gmt":"2023-08-23T00:23:28","guid":{"rendered":"http:\/\/ccvcl.org\/?page_id=3396"},"modified":"2023-08-22T20:23:28","modified_gmt":"2023-08-23T00:23:28","slug":"csc-i6716-fall-2023-assignment-1","status":"publish","type":"page","link":"http:\/\/ccvcl.org\/csc-i6716-fall-2023-assignment-1\/","title":{"rendered":"CSc I6716 Fall 2023 -Assignment 1"},"content":{"rendered":"\n<p>Computer Science – The City College of New York<br><strong>Computer Vision<br>Assignment 1 ( Deadline: 09\/24 Sunday) before midnight)<\/strong><br>===============================================================<br>Note: All the writings of your assignments(including both writing and project assignments ) must be in “soft” copies (<strong>in a single PDF file<\/strong>)  by sending it to Prof. Zhu &lt;<span class=\"has-inline-color has-vivid-cyan-blue-color\">cv.zhu.ccny@gmail.com<\/span>> via an email attachment. You are responsible for the lose of your submissions if you don’t include  “<strong>CSC I6716 Fall 2023 – Assignment 1<\/strong> ” in the <strong>subject <\/strong>of your email. For your programming part, in addition to the writing report in PDF, please also send your source code in a separate file – in their original formats; please don’t format them into PDF or Word formats. Please don’t send in your images and executable.  You may want to include images, tables, etc in your report if they show results of your work. Please write your names and IDs (last four digits) in both files – for your report and the code, and use a meaningful and unique file name for your submission. Please also write your name either in the Sending Line or the email body.<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p><strong>I. Writing Assignments (10×4 = 40 points)<br>&nbsp;&nbsp;<\/strong>(1). How does an image change (e.g., objects’ sizes in the image, field of view, etc.) when you change the zoom factors of your pinhole camera (i.e., the focal length of a pinhole camera is changed)?<br>(2). Give an intuitive explanation why a pinhole camera has an infinite depth of field, i.e., the images of objects are always sharp regardless their distances from the camera.<br>(3). In the thin lens model, 1\/o + 1\/i = 1\/f, there are three variables, the focal length f, the object distance o and the image distance i (please refer to the Slides of the Image Formation lecture). If we define Z = o-f, and z = i-f, please write a few words to describe the physical meanings of Z and z, and then prove that Z*z = f*f given 1\/o + 1\/i = 1\/f.<br>(4). Prove that, in the pinhole camera model, three collinear points in the world (i.e., they lie on a line&nbsp; in 3D space) are imaged into three collinear points on the image plane. You may either use geometric reasoning (with line drawings) or algebra deduction (using equations).<br><br><strong>II. Programming&nbsp; Assignments (<\/strong>Matlab preferred – here is a&nbsp;<a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2019\/09\/matlab.pdf\">quick matlab tutorial<\/a>. &nbsp;You may use C++, Java or Python if you like, but you may need to show the running of your program during my office hours when I ask you. If you don’t have a Matlab license,&nbsp;CUNY faculty and students will be able to download a standalone Matlab version by creating an account using your CCNY email account at&nbsp;<a href=\"https:\/\/www.ccny.cuny.edu\/it\/matlab-and-simulink\">this website<\/a><strong>.&nbsp;)<\/strong>&nbsp;(15×4 = 60 points)<br><br>Image formation.&nbsp; In this small project, you are going to read, manipulate and write image data. The purpose of the project is to make you familiar with the basic digital image formations. Your program should do the following things:<\/p>\n\n\n\n<ol><li>Read in a color image C1(x,y) = (R(x,y), G(x,y), B(x,y)) in Windows BMP format, and display it.<\/li><li>Display the images of the three color components, R(x,y), G(x,y) and B(x,y), separately. You should display three black-white-like images.<\/li><li>Generate an intensity image I(x,y) and display it. You should use the equation I = 0.299R + 0.587G + 0.114B (the NTSC standard for luminance) and tell us what are the differences between the intensity image thus generated from the one generated using a simple average of the R, G and B components. Please use an algorithm to show the differences instead by just observing the images by your eyes.<\/li><li>The original intensity image should have 256 gray levels.&nbsp; Please uniformly quantize this image into K levels ( with K=4, 16, 32, 64).&nbsp; As an example,&nbsp; when K=2,&nbsp; pixels whose values are below 128 are turned to 0,&nbsp; otherwise to 255.&nbsp; Display the four quantized images with four different K levels,&nbsp; and tell us&nbsp;how the images still look like or different from the original ones, and where you cannot see any differences.<\/li><li>Quantize&nbsp; the original three-band color image C1(x,y) into K level color images CK(x,y)= (R'(x,y), G'(x,y), B'(x,y)) (with uniform intervals) , and display them. You may choose K=2 and 4 (for each band).&nbsp; Do they have any advantages in viewing and\/or in computer processing (e.g. transmission or segmentation)?<\/li><li>Quantize&nbsp; the original three-band color image C1(x,y) into a color image CL(x,y)= (R'(x,y), G'(x,y), B'(x,y)) (with a logarithmic function) , and display it. You may choose&nbsp; a function&nbsp; I’ =C ln (I+1) ( for each band), where I is the original value (0~255) , I’ is the quantized value,&nbsp; and C is a constant to scale I’&nbsp; into (0~255), and ln is the natural logarithmic function.&nbsp; Please describe how you find the best C value so for an input in the range of 0-255, the output range is still 0 – 255. Note that when I = 0, I’ = 0 too.<\/li><\/ol>\n\n\n\n<p><strong>Please for each of the above (1-6), provide your analysis \/ observations \/ conclusions, rather than just show the experimental results in images and\/or charts.<\/strong>&nbsp;I have provided a piece of&nbsp;<a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/CSCI6716-2018s\/Homework\/ImageFormat.m\">starting code<\/a>&nbsp;for you to use. Questions 1 and 2 have been done in the Matlab code.&nbsp; You only need to work on 3 to 6 (15×4 = 60 points). You may use&nbsp;<a href=\"http:\/\/ccvcl.org\/wp-content\/uploads\/2019\/09\/IDPicture.png\">Prof. Zhu’s old ID picture<\/a>&nbsp; as well as other pictures for testing your algorithms.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Computer Science – The City College of New YorkComputer VisionAssignment 1 ( Deadline: 09\/24 Sunday) before midnight)===============================================================Note: All the writings of your assignments(including both writing and project assignments ) must&hellip;<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-templates\/fullwidth.php","meta":{"footnotes":""},"_links":{"self":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/3396"}],"collection":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/comments?post=3396"}],"version-history":[{"count":2,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/3396\/revisions"}],"predecessor-version":[{"id":3398,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/3396\/revisions\/3398"}],"wp:attachment":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/media?parent=3396"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}