{"id":361,"date":"2019-01-30T12:13:25","date_gmt":"2019-01-30T17:13:25","guid":{"rendered":"http:\/\/ccvcl.org\/?page_id=361"},"modified":"2021-03-31T09:53:52","modified_gmt":"2021-03-31T13:53:52","slug":"smart-and-accessible-transportation-hub","status":"publish","type":"page","link":"http:\/\/ccvcl.org\/smart-and-accessible-transportation-hub\/","title":{"rendered":"Smart and Accessible Transportation Hub"},"content":{"rendered":"\n<p><strong>Project Status:<\/strong>&nbsp;Active (Started: 2016)<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Research Description<\/h3>\n\n\n\n<p>The CUNY-Rutgers-Lighthouse Guild joint project Smart and Accessible Transportation Hub (<a href=\"https:\/\/www.youtube.com\/watch?v=KXZnxyA30KM&amp;feature=youtu.be\">SAT-Hub<\/a>) started with an NIST Global City Teams Challenge (GCTC) 2016 Action Cluster Smart Transportation Hub. The project aims to collaborate with NJ Transit and Port Authority, to create and test Smart Transportation Hub (Smart T-Hub) with minimal changes of the current cyber-physical infrastructure of their stations to serve people who have traveling challenges, including travelers who are blind or with Autism Spectrum Disorder (ASD). The SAT-Hub testbed is leading to project inspired discovery at least in the following areas: (1) 3D semantic facility model based localization with smartphone images, which offers a renovation- or reconstruction-free infrastructure approach for user localization and meanwhile provides a way of facility model updating. (2) Optimal sensor placement and rapid calibration using 3D semantic model in 3D space, which will advance our understanding in deploying smart sensors in a complex and large-scale dynamic environment. (3) Deep-learning-based human crowd analysis, which will go beyond the typical image classification and understanding tasks for deep learning into complex 3D environments. (4) Human-in-the-loop traveling guidance with multi-facet inputs, including information of physical 3D models, crowd and traffic flows, security alerts, transportation schedules and user preferences. The research is supported by the DHS Summer Research Team (SRT) Program, the NSF Emerging Frontiers in Research and Innovation (EFRI) Program and most recently by the NSF Smart and Connected Community (S&amp;CC) Program, the NSF Partnerships for Innovation (PFI) Program, Bentley Systems, Inc., and the ODNI Intelligence Community Center of Academic Excellence (IC CAE) at Rutgers.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Sponsors<\/h3>\n\n\n\n<p><strong>National Science Foundation Partnerships for Innovation (PFI) Program<\/strong>(<a href=\"https:\/\/www.nsf.gov\/awardsearch\/showAward?AWD_ID=1827505\">Award #1827505<\/a>) Division Of Industrial Innovation and Partnerships (IIP) (Program Director: Jesus Soriano Molla): FPI-RP: Smart and Accessible Transportation Hub for Assistive Navigation and Facility Management. PI: Zhigang Zhu (CCNY); Co-PIs: Arber Ruci (CUNY), Cecilia Kelnhofer-Feeley (Rutgers), Jie Gong (Rutgers), William Seiple (Lighthouse Guild). Senior Personnel: Huy Vo (CCNY), Hao Tang (BMCC). Duration: 09\/15\/2018-08\/31\/2021 [This is a partnership between the three research institutions (CUNY, Rutgers and Lighthouse Guild) and a primary industrial partner &#8211; Bentley Systems, Incorporated (Dr. Zheng Yi Wu). Other community partners include: Goodwill, NJ Passaic County, NJ Transit, NYC Mayor’s Office for People with Disabilities (MOPD), NYS Commission for the Blind (NYSCB), among others.]<\/p>\n\n\n\n<p><strong>NSF Smart and Connected Community (S&amp;CC) Program<\/strong>&nbsp;(<a href=\"https:\/\/www.nsf.gov\/awardsearch\/showAward?AWD_ID=1737533\">Award #1737533<\/a>), Division Of Computer and Network Systems (CNS), CISE (Program Manager: Ralph Wachter): SCC-Planning: Towards Smart and Accessible Transportation Hub &#8211; Research Capacity Building and Community Engagement. PI: Z. Zhu (CCNY); Co-PIs: C. Kelnhofer-Feeley (Rutgers), J. Gong (Rutgers), W. Seiple (Lighthouse Guild), C. Kamga (CCNY). Duration: 09\/01\/2017-08\/31\/2018.<\/p>\n\n\n\n<p><strong>Office of the Director of National Intelligence (ODNI)#HHM402-19-1-0003 <\/strong>(via Rutgers)<strong>.<\/strong> &nbsp;Intelligence Community Center of Academic Excellence (IC CAE) at Rutgers, The State University of New Jersey, &nbsp;CCNY PI: Zhigang Zhu (CS), CoI: Yingli Tian (EE), The City College of New York. Duration: Five years, 2019-2024<\/p>\n\n\n\n<p><strong>Office of the Director of National Intelligence (ODNI)<\/strong> #<strong>HHM402-18-1-0007 <\/strong>(via Rutgers)<strong>.<\/strong> Intelligence Community Centers for Academic Excellence (IC CAE) Critical Technology Studies (CTS) Program at Rutgers, The State University of New Jersey, Consortium Member, CCNY PI: Zhigang Zhu (CS), CoI: Yingli Tian (EE), The City College of New York. Duration: Three years (10\/01\/2018 – 09\/30\/2021).<\/p>\n\n\n\n<p><strong>Department of Homeland Security Follow-On of Summer Research Team For MSIs<\/strong>&nbsp;(via ORAU DE-SC0014664), Learning, Visualization and Utilization of Crowd Analytics for Security and Navigation Using 3D Semantic Models, PI: Zhigang Zhu (with students: Greg Olmschenk and Vishnu Nair; CCICADA Collaborator at Rutgers: Jie Gong). Duration: 18 months (03\/01\/2017-08\/28\/2018)<\/p>\n\n\n\n<p><strong>Bentley Collaborative Research Agreement (CRA<\/strong>), Assistive Navigation Using 3D Semantic Models and Crowd Analytics. PI: Z. Zhu; <a href=\"https:\/\/www.bentley.com\/\">Bentley Systems, Inc.<\/a> Collaborator: Dr. Zheng Yi Wu. Duration: Three Years (08\/2017-08\/2020)<\/p>\n\n\n\n<p><strong>Department of Homeland Security Summer Research Team For MSIs (via ORAU)<\/strong>,&nbsp;<a href=\"https:\/\/www.orau.gov\/dhseducation\/profiles\/srt\/zhu.html\">A Collaborative Vision Approach with Semantic 3D Scene Models for Scalable Crowd Behavior Analysis and Navigation Support<\/a>&nbsp;, PI: Zhigang Zhu ( with students: Greg Olmschenk and Vishnu Nair; CCICADA Collaborator at Rutgers: Jie Gong). Duration: 10 weeks (05\/02\/2016-07\/08\/2016)<\/p>\n\n\n\n<p><a href=\"http:\/\/www.nsf.gov\/awardsearch\/showAward?AWD_ID=1137172\"><strong>NSF EFRI-M3C Award on MAP4VIP<\/strong><\/a><\/p>\n\n\n\n<p><a href=\"http:\/\/ccvcl.org\/research-projects\/\">Back<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Project Status:&nbsp;Active (Started: 2016) Research Description The CUNY-Rutgers-Lighthouse Guild joint project Smart and Accessible Transportation Hub (SAT-Hub) started with an NIST Global City Teams Challenge (GCTC) 2016 Action Cluster Smart&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/361"}],"collection":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/comments?post=361"}],"version-history":[{"count":8,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/361\/revisions"}],"predecessor-version":[{"id":1739,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/361\/revisions\/1739"}],"wp:attachment":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/media?parent=361"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}