{"id":374,"date":"2019-01-30T12:26:05","date_gmt":"2019-01-30T17:26:05","guid":{"rendered":"http:\/\/ccvcl.org\/?page_id=374"},"modified":"2019-04-19T15:58:32","modified_gmt":"2019-04-19T19:58:32","slug":"efri-m3c-map4vip-man-machine-co-learning-for-visually-impaired-people","status":"publish","type":"page","link":"http:\/\/ccvcl.org\/efri-m3c-map4vip-man-machine-co-learning-for-visually-impaired-people\/","title":{"rendered":"EFRI-M3C: MAP4VIP: Man-Machine Co-Learning for Visually Impaired People"},"content":{"rendered":"\n<p><strong>Project Status:<\/strong>&nbsp;Active (Started: 2011)<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Research Description<\/h2>\n\n\n\n<p>The objective of this EFRI-M3C project is to develop models of sensorimotor control in order to establish a set of design criteria for developing improved assistive technologies for visually impaired people. Multimodal sensory information obtained by wearable machine sensors will substitute for and\/or augment impaired vision with somatosensory and other novel stimulation (?transducing?) methods. The project has the following three research threads: (1) Determination of the information needed by visually impaired people to perform wayfinding and arm reaching tasks and the impact on task performance when transducing information through visual, auditory and vibrotactile modalities. (2) Understanding of motor skill acquisition and control through in vivo measurements of brain activity and movement performance. (3) Development of a sensorimotor model through man-machine co-learning, which can be used for improving sensor\/display designs and applied to machines.<\/p>\n\n\n\n<p>The intellectual merit of this research is that it will generate a theoretical foundation for a deeper understanding of the neural mechanisms of sensorimotor integration and motor learning, shedding new light on these functions in humans and machines. This will lead to new design concepts of alternative perception, formulation of required information necessary for successful orientation and wayfinding, and development of cost-effective and revolutionary mechatronic devices to assist visually impaired people in achieving mobility functions comparable to people with normal vision. The interdisciplinary team includes experts in engineering, computer science, psychology, and applied physiology from the City College of New York and Georgia Tech, tackling challenging problems on the boundaries of sensing, cognition, and action. Advisory board members, including experts in (neuro-)ophthalmology and human vision research, as well as counselors at the NYS Commission for the Blind and Visually Handicapped, will provide guidance for the study.<\/p>\n\n\n\n<p>The broader impacts of this research will be assistive technologies for individuals with sensory impairments, whose numbers have been rising due to the increasing population of older adults in the US and around the world. The project will also create new and expand existing academic programs in assistive technologies, brain computer interfaces and sensorimotor integration. It will increase cross-campus education opportunities for students particularly in under-represented groups of the two campuses.<\/p>\n\n\n\n<ul><li><a href=\"http:\/\/www.ccny.cuny.edu\/news\/CCNY-led-Research-Could-Lead-to-Wearable-Sensors-for-Blind.cfm\">Wearable Sensors for the Blind<\/a><\/li><li><a href=\"https:\/\/www.youtube.com\/watch?v=Dy1yIsjUy2A\">EFRI-REM Program 2014<\/a><\/li><li><a href=\"http:\/\/ccvcl.org\/rem-2015\/\">EFRI-REM Program 2015<\/a><\/li><\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Sponsors<\/h2>\n\n\n\n<ul><li><a href=\"http:\/\/www.nsf.gov\/awardsearch\/showAward?AWD_ID=1137172\"><strong>NSF EFRI-M3C Award on MAP4VIP<\/strong><\/a><\/li><li><a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/MAP4VIP\/\"><strong>IEEE\/NSF Workshop on Multimodal and Alternative Perception for Visually Impaired People (MAP4VIP<\/strong>)<\/a>&nbsp;(<a href=\"https:\/\/www.nsf.gov\/awardsearch\/showAward?AWD_ID=1327236\">Sponsored by NSF Award #1327236<\/a>)<\/li><li><strong>City Seeds &#8211; Grant for Interdisciplinary Scientific Research Collaborations<\/strong>, “Wearable and Multimodal Wayfinding for the Visually Impaired,” Zhigang Zhu (Computer Science, PI), Tony Ro (Psychology) and YingLi Tian (Electrical Engineering), 02\/01\/2011- 01\/31\/2012<\/li><\/ul>\n\n\n\n<p><a href=\"http:\/\/ccvcl.org\/research-projects\/\">Back<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Project Status:&nbsp;Active (Started: 2011) Research Description The objective of this EFRI-M3C project is to develop models of sensorimotor control in order to establish a set of design criteria for developing&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"open","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/374"}],"collection":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/comments?post=374"}],"version-history":[{"count":2,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/374\/revisions"}],"predecessor-version":[{"id":492,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/374\/revisions\/492"}],"wp:attachment":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/media?parent=374"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}