{"id":377,"date":"2019-01-30T12:28:40","date_gmt":"2019-01-30T17:28:40","guid":{"rendered":"http:\/\/ccvcl.org\/?page_id=377"},"modified":"2019-01-30T13:26:51","modified_gmt":"2019-01-30T18:26:51","slug":"a-system-approach-to-adaptive-multi-modal-sensor-designs","status":"publish","type":"page","link":"http:\/\/ccvcl.org\/a-system-approach-to-adaptive-multi-modal-sensor-designs\/","title":{"rendered":"A System Approach to Adaptive Multi-modal Sensor Designs"},"content":{"rendered":"\n<p><strong>Project Status:<\/strong> Active (Started: 2008)<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Research Description<\/h2>\n\n\n\n<p>Recently, a great deal of effort has been put into adaptive and tunable multimodal sensor designs to address the challenging problems of detecting and identifying targets in highly cluttered, dynamic scenes. Whereas these efforts have created or will soon create novel adaptive multimodal sensors, it is unfortunate they are not up to the expectations from the real-world applications. Historically, the development of such a new sensor system began with overall specifications followed by specifications for the various elements followed by component development, system integration and test. For complex systems, this process is slow, expensive and inflexible because of the large number of requirements, constraints and design options that need to be resolved.<\/p>\n\n\n\n<p>Therefore, we propose to demonstrate an iterative system approach to adaptive multimodal sensor designs. This approach will be based on the integration of tools developed by us for the physics-based simulation of complex scenes and targets and modeling of sensors with a workflow management system that enables the integration of hardware and software modules. The goal is to reduce development time and system cost while achieving better results through an iterative process that incorporates simulation, evaluation and refinement of critical elements.<\/p>\n\n\n\n<p>As a case study, we use an effective peripheral-fovea design as an example of how tradeoffs can be done within a system context. This design is inspired by the biological vision systems for achieving real-time imaging with a hyperspectral\/range fovea and panoramic peripheral view. This design and the related data exploitation algorithms will be simulated and evaluated in our general framework. The results of this project will be an optimized design for the peripheral-fovea structure and a system model for how sensor systems can be developed within a simulation context. The results will then be available as tools for the design of other sensor systems.<\/p>\n\n\n\n<p>The PIs and other researchers at both CCNY and RIT will leverage their expertise in data simulation and data management at RIT, sensor design and data exploitation at CCNY to yield a system approach for adaptive multimodal sensor designs. The combined hyperspectral data\/sensor simulation and management tools will support detailed system simulation with synthetic image data from virtual instruments. This data can then be used to evaluate design trade-offs, image processing algorithms and sensor fusion using performance metrics that can be specified for different scenarios.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Sponsors<\/h2>\n\n\n\n<p><strong>AFOSR 2011 Summer Faculty Fellowship Program<\/strong>, Multimodal Layered Sensing for Modeling and Detection, Zhigang Zhu (PI), Edgardo Molina (PhD Student), T. Wang (PhD Student), 05\/23\/2011- 07\/30\/2011<\/p>\n\n\n\n<p><strong>AFOSR<\/strong>&nbsp;DISCOVERY CHALLENGE THRUSTS (DCTs), Award #FA9550-08-1-0199, A System Approach to Adaptive Multi-modal Sensor Designs, 04\/01\/2008 –03\/31\/2012<br><strong>PI:<\/strong>&nbsp;Professor Zhigang Zhu (CCNY)<br><strong>Co-PI:<\/strong>&nbsp;Professor Harvey Rhody (RIT)<\/p>\n\n\n\n<p><strong>DURIP<\/strong>, Award #W911NF-08-1-0531, Equipment for Networked Autonomous Mobile Systems, 09\/26\/2008-09\/25\/2009<br><strong>PI:<\/strong> Professor Jizhong Xiao (EE)<br><strong>Co-PI:<\/strong> Professor Zhigang Zhu (CS)<\/p>\n\n\n\n<p><a href=\"http:\/\/ccvcl.org\/research-projects\/\">Back<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Project Status: Active (Started: 2008) Research Description Recently, a great deal of effort has been put into adaptive and tunable multimodal sensor designs to address the challenging problems of detecting and&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"open","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/377"}],"collection":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/comments?post=377"}],"version-history":[{"count":1,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/377\/revisions"}],"predecessor-version":[{"id":378,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/377\/revisions\/378"}],"wp:attachment":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/media?parent=377"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}