{"id":380,"date":"2019-01-30T12:31:02","date_gmt":"2019-01-30T17:31:02","guid":{"rendered":"http:\/\/ccvcl.org\/?page_id=380"},"modified":"2019-01-30T13:26:51","modified_gmt":"2019-01-30T18:26:51","slug":"nsf-computing-research-infrastructure-cri-program-center-of-perceptual-robotics-intelligent-sensors-and-machines-prism","status":"publish","type":"page","link":"http:\/\/ccvcl.org\/nsf-computing-research-infrastructure-cri-program-center-of-perceptual-robotics-intelligent-sensors-and-machines-prism\/","title":{"rendered":"NSF Computing Research Infrastructure (CRI) Program: Center of Perceptual Robotics, Intelligent Sensors and Machines (PRISM)"},"content":{"rendered":"\n<p><strong>Project Status:<\/strong> Active (Started: 2006)<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Research Description<\/h2>\n\n\n\n<p>The multidisciplinary nature of intelligent robotics research requires collaborations among researchers with expertise in robotics, artificial intelligence, computer vision, wireless communication, advanced sensors and mechanical design. Robotics research and education at the City College of New York (CCNY) is currently scattered in several departments (EE, CS and ME) of the School of Engineering (SOE). The goal of the MII planning project (NSF grant No. CNS-0424539) and the NSF CRI project (Grant No. CNS-0551598) is to establish a Center for Perceptual Robotics, Intelligent Sensors and Machines (PRISM) in order to enhance the comprehensive robotics research infrastructure and to group researchers together to carry out nationally competitive research in these fields.<\/p>\n\n\n\n<p>Leveraging our previous research expertise of the team members (see below) in the related fields, the main theme of the planned PRISM Center we have identified in the next few years will be Robotized Intelligent SEnsor NETworks in 3D space (<strong>RISE-NET<\/strong>). Around this theme, four research thrusts will be considered:<\/p>\n\n\n\n<ul><li><strong>Distributed Perceptual Robotics<\/strong>&nbsp;(robotized sensor networks, sensing, control, and coordination of robot teams in 3D space);<\/li><li><strong>Multimodal Intelligent Sensors<\/strong>&nbsp;(multimodal sensors for target recognition, subject tracking, and event understanding);<\/li><li><strong>Pervasive Smart Machines<\/strong>&nbsp;(human-robot interaction, and human-machine visual and speech interfaces in a large sensor network) and<\/li><li><strong>Reliable Communications for RISE-NET<\/strong>&nbsp;(wireless sensor\/ad hoc networks, ZigBee standardization).<\/li><\/ul>\n\n\n\n<p>The PRISM center will be built upon three pillars: research, education, and outreach, and with the aim to become a center of excellence in cutting-edge research as well as a national urban model for minority education in robotics and related fields. This will be achieved through integration of research with coherent educational and outreach activities and through early recruiting and retention via affinity mentoring at all levels of education. The education activities at the PRISM center include: introducing new courses with real research projects, reforming senior design courses around the RISE-NET theme, launching a student robotics club and robot design competition, and mentoring minority students in research projects.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Sponsors<\/h2>\n\n\n\n<p><strong>NSF CISE<\/strong>&nbsp;Computing Research Infrastructure (CRI) Program (Grant No. CNS-0551598): Center for Perceptual Robotics, Intelligent Sensors and Machines (PRISM) at City College of NY, 03\/15\/2006- 03\/14\/2009.&nbsp;<br><strong>PI<\/strong>: Xiao, Jizhong ;&nbsp;<br><strong>Leading Co-PI<\/strong>: Zhu, Zhigang;<br><strong>Other Co-PIs<\/strong>: Lee, Myung J.; Wolberg, George; SPs : Ali M. Sadegh, Esther Levin, Michael Grossberg, Umit Uyar<\/p>\n\n\n\n<p><strong>NSF MII<\/strong>&nbsp;Planning Project (Grant Number CNS-0424539): Center for Perceptual Robotics, 12\/01\/04 -11\/30\/05,&nbsp;<br><strong>Co-PIs<\/strong>: J. Xiao, Z. Zhu<\/p>\n\n\n\n<p><strong>CCNY Grove School of Engineering<\/strong>, Lecture Series on Computer Vision, Robotics and Human-Computer Interaction<\/p>\n\n\n\n<p><a href=\"http:\/\/ccvcl.org\/research-projects\/\">Back<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Project Status: Active (Started: 2006) Research Description The multidisciplinary nature of intelligent robotics research requires collaborations among researchers with expertise in robotics, artificial intelligence, computer vision, wireless communication, advanced sensors and&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"open","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/380"}],"collection":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/comments?post=380"}],"version-history":[{"count":1,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/380\/revisions"}],"predecessor-version":[{"id":381,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/380\/revisions\/381"}],"wp:attachment":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/media?parent=380"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}