{"id":394,"date":"2019-01-30T12:42:59","date_gmt":"2019-01-30T17:42:59","guid":{"rendered":"http:\/\/ccvcl.org\/?page_id=394"},"modified":"2019-01-30T12:42:59","modified_gmt":"2019-01-30T17:42:59","slug":"remote-hearing-multimodal-human-signature-detection-via-ptz-ir-and-ldv-sensors","status":"publish","type":"page","link":"http:\/\/ccvcl.org\/remote-hearing-multimodal-human-signature-detection-via-ptz-ir-and-ldv-sensors\/","title":{"rendered":"Remote Hearing: Multimodal Human Signature Detection via PTZ, IR and LDV Sensors"},"content":{"rendered":"\n<p><strong>Project Status:<\/strong> Active (Started: 2003)<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Research Description<\/h2>\n\n\n\n<p>Laser Doppler vibrometer (LDV) is a non-contact, remote and high resolution voice detector. Vibration of the objects caused by voice reflects the voice itself. After the enhancement with a Gaussian bandpass filtering and an adaptive volume scaling, the LDV voice signals were mostly intelligible from targets without retro-reflective finishes at short or medium distances (&lt; 100m). By using retro-reflective tapes, the distance could be as far as 300 meters. Infrared (IR) imaging for target selection and localization was also discussed for LDV listening. A system has been set up with three types of sensors (IR cameras, PTZ color cameras and LDVs) for performing integration of multimedia sensors in human signature detection. The basic idea is to provide an advanced augmented interface in order to give users the best cognitive understanding of the environment, the sensors and the events.<\/p>\n\n\n\n<p>The research challenge is, without retro-reflective tape treatment, the LDV voice signals were still very noisy from targets at medium and large distances. Therefore, with the state-of-the-art sensor technology, more advanced signal enhancement techniques are needed. Further sensor improvement is also necessary. In addition, automatic targeting and intelligent refocusing is a technical issue that deserves research attention for long range LDV listening. To improve the performance and the efficiency of Laser Doppler Vibrometers (LDVs) for long-range hearing, we design an active multimodal sensing platform that integrates a Pan-Tilt-Zoom (PTZ) camera, a mirror and a Pan-Tilt-Unit (PTU) to the LDV . With the assistance of the vision and active control components, the LDV can automatically select the best reflective surfaces, point the laser beam to the selected surfaces, and quickly focus the laser beam. For accomplishing these functions, distance measurement and sensor calibration methods are proposed using the triangulation between the PTZ camera and the mirrored LDV laser beam. Based on both the measured distances and the return signal levels of the LDV, a fast and automatic LDV focusing algorithm is designed. Furthermore, strategies of surface selection and laser pointing are designed for the platform to automatically point the laser beam to the designated surfaces.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/LDV\/LDV2007\/LDV-Hearing.html\">Hear some voice clips captured by the LDV sensor<\/a><\/h4>\n\n\n\n<h2 class=\"wp-block-heading\">Related Publications and Links<\/h2>\n\n\n\n<ol><li>Y. Qu, T. Wang and Z. Zhu, <a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/LDV-Paper-final-revision.pdf\">An Active Multimodal Sensing Platform for Remote Voice Detection<\/a>, IEEE\/ASME International Conference on Advanced Intelligent Mechatronics (AIM 2010), Montreal, July 6-9, 2010<\/li><li>T. Wang, Z. Zhu, and A. Divakaran, <a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/Wang-SPIE-2010.pdf\">Long-Rang, Audio and Audio-Visual Event Detection Using a Laser Doppler Vibrometer<\/a>, SPIE Defense, Security and Sensing: Evolutionary and Bio-Inspired Computation: Theory and Applications IV, April, 2010<\/li><li>Y. Qu, T. Wang and Z. Zhu, <a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/CVPR09-Biometrics09-Qu.pdf\">Remote Audio\/Video Acquisition for Human Signature Detection<\/a>, The 3rd IEEE CVPR Biometrics Workshop, June 25, 2009<\/li><li>Z. Zhu, W. Li, E. Molina and G. Wolberg, LDV Sensing and Processing for Remote Hearing in a Multimodal Surveillance System, Chapter 4 in <a href=\"http:\/\/www.artechhouse.com\/default.asp?frame=book.asp&amp;book=978-1-59693-184-8&amp;Country=US&amp;Continent=NO&amp;State=\">Multimodal Surveillance: Sensors, Algorithms and Systems<\/a>, Z. Zhu and T. S. Huang (eds), ISBN-10: 1596931841, Artech House Publisher, July 2007, pp 59-90.<\/li><li>W. Li, M. Liu, Z. Zhu and T. S. Huang, <a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/ICPR06-LDV-CUNY.pdf\">LDV Remote Voice Acquisition and Enhancement<\/a>, International Conference on Pattern Recognition (ICPR’06), Hong Kong, China, August 2006<\/li><li>W. Li, Z. Zhu and G. Wolberg, <a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/ICME06-LDV-Camera-Ready-Final-2.pdf\">Remote Voice Acquisition in Multimodal Surveillance<\/a>, accepted to IEEE International Conference on Multimedia &amp; Expo (ICME), Toronto, Canada, July 9-12 2006, oral presentation, acceptance rate 22%<\/li><li>Z. Zhu, W. Li and G. Wolberg, <a href=\"http:\/\/www-cs.engr.ccny.cuny.edu\/~zhu\/CVPR2005\/Final\/OTCBVS2005-LDV-final.pdf\">Integrating LDV audio and IR video for remote multimodal surveillance<\/a>, The 2nd Joint IEEE International Workshop on Object Tracking and Classification in and Beyond the Visible Spectrum (OTCBVS&#8217;05), San Diego, CA, US, Monday June 20, 2005<\/li><li>Z. Zhu, W. Li, <a href=\"http:\/\/www-cs.ccny.cuny.edu\/%7Ezhu\/LDV\/FinalReportsHTML\/CCNY-LDV-Tech-Report-html.htm\">Integration of laser vibrometer and infrared video for multimedia surveillance display<\/a>, TR-2005006, Computer Science Department, Graduate Center, City University of New York, April 2005. (more voice clips are available by click the above link)<\/li><\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">Collaborators<\/h2>\n\n\n\n<ul><li>Dr. Ajay Divakaran, Sarnoff Corporation<\/li><li>Professor Thomas Huang, University of Illinois at Urbana-Champaign (UIUC)<\/li><li>Professor Ning Xiang, Rensselaer Polytechnic Institute (RPI)<\/li><li>Professor George Wolberg, Department of Computer Science, The City College of New York<\/li><\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Research Associate and Assistants at CUNY<\/h2>\n\n\n\n<p>Yufu Qu, Tao Wang, Edgardo Molina, Rui Li, Wai L. Khoo, Weihong Li<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Sponsors<\/h2>\n\n\n\n<p><strong>NCIIA E-Team Award<\/strong>, “Automating Long-range Vibrometry through Vision and Web Technologies” (#6629-09), PI: Z. Zhu, , 09\/01\/2009- 01\/31\/2011<\/p>\n\n\n\n<p><strong>AFRL\/HECB<\/strong>, Award No. F33615-03-1-63-83, Integration of Laser Vibrometry with Infrared Video for Multimedia Surveillance Displays, 08\/24\/03 -10\/24\/04, PI: Z. Zhu<\/p>\n\n\n\n<p><strong>CUNY Research Equipment Grant Award<\/strong>, Integration of Laser Vibrometry, Infrared and Video for Multimodal Human Detection, 02\/19\/04-02\/18\/05, Co-PIs &#8211; Z. Zhu and G. Wolberg<\/p>\n\n\n\n<p><a href=\"http:\/\/ccvcl.org\/research-projects\/\">Back<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Project Status: Active (Started: 2003) Research Description Laser Doppler vibrometer (LDV) is a non-contact, remote and high resolution voice detector. Vibration of the objects caused by voice reflects the voice itself.&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/394"}],"collection":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/comments?post=394"}],"version-history":[{"count":1,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/394\/revisions"}],"predecessor-version":[{"id":395,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/394\/revisions\/395"}],"wp:attachment":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/media?parent=394"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}