{"id":403,"date":"2019-01-30T12:48:18","date_gmt":"2019-01-30T17:48:18","guid":{"rendered":"http:\/\/ccvcl.org\/?page_id=403"},"modified":"2019-01-30T12:48:18","modified_gmt":"2019-01-30T17:48:18","slug":"virtualized-classroom-the-next-generation-e-learning-system","status":"publish","type":"page","link":"http:\/\/ccvcl.org\/virtualized-classroom-the-next-generation-e-learning-system\/","title":{"rendered":"Virtualized Classroom &#8211; the Next Generation e-Learning System"},"content":{"rendered":"\n<p><strong>Project Status:<\/strong> Complete (Years: 2003 &#8211; 2004)<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Research Description<\/h2>\n\n\n\n<p>A domain of primary importance in the future of web-based technology and digital libraries is distance and electronic education (e-learning). Multimedia materials from classrooms and seminars are rich sources of information. Today&#8217;s first generation e-learning systems primarily adopt a “record-and-playback” approach, which does not leverage the processing capabilities (during live capture, after-capture post-processing, and during later user interaction with archived materials) that we believe will underlie the next generation of more automated, flexible, comprehensible, and individualized e-learning systems. The goal of the Virtualized Classroom project is to design novel software systems to address fundamental research problems occurring in different components of a next-generation, processing-enhanced e-learning system for college and graduate courses. It includes the following key components:<\/p>\n\n\n\n<p>Automatic data collection, analysis, and multi-modal synchronization. Intelligent post-processing: compression, cross-media indexing and archiving. Augmented presentation and user-controllable views. Natural Interaction between students-students, students-teacher and students-computer.<\/p>\n\n\n\n<p>In the Virtualized Classroom project, we aim to create a natural environment that could give students interactive experiences equivalent to or even better than the real classroom, which is enabled by virtual instructor presence (generated by computer vision, intelligent question-answering and virtual reality techniques), user-selectable and fully-indexed visual aids and materials, full communications between students-students, students-instructor and students-virtual instructors (computers), all organized in the Virtualized Classroom environment that are more natural and friendly.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Sponsors<\/h2>\n\n\n\n<p><strong>CUNY CISDD grant<\/strong>, 3D Virtual Classroom: the Next Generation Learning Environment, 04\/01\/03 – 03\/31\/04, PI: Z. Zhu<\/p>\n\n\n\n<p><a href=\"http:\/\/ccvcl.org\/research-projects\/\">Back<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Project Status: Complete (Years: 2003 &#8211; 2004) Research Description A domain of primary importance in the future of web-based technology and digital libraries is distance and electronic education (e-learning). Multimedia materials&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/403"}],"collection":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/comments?post=403"}],"version-history":[{"count":1,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/403\/revisions"}],"predecessor-version":[{"id":404,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/403\/revisions\/404"}],"wp:attachment":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/media?parent=403"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}