{"id":424,"date":"2019-01-30T13:02:39","date_gmt":"2019-01-30T18:02:39","guid":{"rendered":"http:\/\/ccvcl.org\/?page_id=424"},"modified":"2019-01-30T13:26:51","modified_gmt":"2019-01-30T18:26:51","slug":"localization-and-recognition-of-characters-and-numbers-on-moving-freight-trains","status":"publish","type":"page","link":"http:\/\/ccvcl.org\/localization-and-recognition-of-characters-and-numbers-on-moving-freight-trains\/","title":{"rendered":"Localization and Recognition of Characters and Numbers on Moving Freight Trains"},"content":{"rendered":"\n<p><strong>Project Status:<\/strong> Complete (Years: 1996 &#8211; 1998)<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Research Description<\/h2>\n\n\n\n<p>Freight trains are the major transportation vehicles for goods such as steels, oils, coal and other minerals in inland China. Usually freight trains come to a destination, each of them with 20 to 50 cars (containers) of about 13 meter long, and loaded with various cargos. Because of the large amount of cargoes going in and out in different places all around China, there are cases when some of the cars go to wrong destinations, or the loads are not correct, some of them with very expensive materials. Therefore it is extremely important to verify the identity and to accurate weight the load of each car when a freight train go in or out a (weighting) station. In most of the cars of freight trains, two pieces of important information are labeled on the car (Figure 1). On the head (or the center) of a car of the freight train, the type and numbers of this car shows the identity of the car, while on the tail of the car, important information such as maximum load, self-weight, volume and length is used for accurate weight the load of the car. In the past, trains move across the weighting station at the speed of about 20 kilometers per hour, and one or two human staffs tries to quickly read and write down the information of the cars on a piece of paper, while the load is being weighted (dynamically). However, there often cases that several cars are not recorded, and the staffs get fatigued soon.. With the large amounts of requirements, we have developed an automatic real-time vision system for frieght train management in large companies such as steel, oil and coal factories. There are two modules in our system &#8211; Image Capture Module and Character Recognition Module. In the automatic Image Capture Module (with hardware and software), two cameras with different focal lengths and fields of views were installed in a weighting station to capture the side images of the passing trains. We used IR sensors and visual motion detection techniques to capture the areas where types, numbers and other information of each car. In the Character Recognition Module, we developed an effective method for segmenting and recognizing the characters on freight trains automatically. This algorithm consists of three components: image segmentation on gray-gradient image, image analysis based on the domain knowledge and character segmentation\/recognition based on template matching, neural network and recognition feedback. Several systems have been installed and tested in Chende, Hebei Province and northeastern China.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Sponsors<\/h2>\n\n\n\n<p><strong>Chengde Automatic Equipment Company<\/strong>, Automatic Character and Number Localization and Recognition for Managing Moving Freight Trains, 1996-1998, Co-PIs (Zhu, Shi and Yu)<\/p>\n\n\n\n<p><a href=\"http:\/\/ccvcl.org\/research-projects\/\">Back<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Project Status: Complete (Years: 1996 &#8211; 1998) Research Description Freight trains are the major transportation vehicles for goods such as steels, oils, coal and other minerals in inland China. Usually freight&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"open","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/424"}],"collection":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/comments?post=424"}],"version-history":[{"count":1,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/424\/revisions"}],"predecessor-version":[{"id":425,"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/pages\/424\/revisions\/425"}],"wp:attachment":[{"href":"http:\/\/ccvcl.org\/wp-json\/wp\/v2\/media?parent=424"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}